In [8]:
#Statistical or Mathematics Function
import pandas as pd
data={
    'one'      :pd.Series([1,2,3,4]),
    'two'      :pd.Series([10,20,30,40]),
    'three'    :pd.Series([100,200,300,400]),
    'four'     :pd.Series([1000,2000,3000,4000])
}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [7]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [16]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [17]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [18]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [22]:
de=pd.DataFrame({'A':[1,2,3,5,5,5,6],'B':[10,20,40,40,40,50,60]})
print(de['A'].mode())
print(de['B'].mode())

0    5
Name: A, dtype: int64
0    40
Name: B, dtype: int64